`timescale 1ns / 1ns

module tb_servo_ctrl;

// ******************************************************************** //
// ********************* Signal Declarations ************************** //
// ******************************************************************** //

reg sys_clk;            // 系统时钟
reg sys_rst_n;          // 系统复位信号
reg [8:0] servo_angle;  // 舵机角度输入

wire servo_pwm;         // PWM输出信号

// ******************************************************************** //
// ******************** Instantiation of the DUT ********************** //
// ******************************************************************** //

servo_ctrl uut 
(
    .sys_clk(sys_clk),
    .sys_rst_n(sys_rst_n),
    .servo_angle(servo_angle),
    .servo_pwm(servo_pwm)
);

// ******************************************************************** //
// ********************* Clock Generation **************************** //
// ******************************************************************** //

initial begin
    sys_clk = 0;
end

always #21 sys_clk = ~sys_clk;  // 24MHz时钟的近似信号，半周期为21ns

// ******************************************************************** //
// ************************ Testbench Code **************************** //
// ******************************************************************** //

initial begin
    // 初始化信号
    sys_clk = 0;
    sys_rst_n = 0;
    servo_angle = 0;
    
    // 释放复位信号
    #100 sys_rst_n = 1;

    // 给不同的舵机角度进行测试
    // 设置为0度，观察PWM信号（1ms高电平）
    #20000000 servo_angle = 0;  
    
    // 设置为90度，观察PWM信号（1.5ms高电平）
    #20000000 servo_angle = 90;  
end

endmodule
