`timescale 1ns / 1ns

module tb_stepper_motor_ctrl_4;

// ******************************************************************** //
// ********************* Signal Declarations ************************** //
// ******************************************************************** //

reg        sys_clk;          // 测试时钟信号
reg        sys_rst_n;        // 测试复位信号
reg [31:0]  target_angles;    // 测试目标角度信号

wire       step_pulse;       // 模块输出的脉冲信号
wire       direction;        // 模块输出的方向信号
wire       reached_target;   // 模块输出的到达目标标志

// ******************************************************************** //
// ******************** Instantiation of the DUT ********************** //
// ******************************************************************** //

stepper_motor_ctrl_4 UUT
(
    .sys_clk(sys_clk),            // 时钟输入连接到系统时钟
    .sys_rst_n(sys_rst_n),        // 复位信号输入
    .target_angles(target_angles),// 输入目标角度
    
    .step_pulse(step_pulse),      // 输出脉冲信号
    .direction(direction),        // 输出方向信号
    .reached_target(reached_target) // 输出到达目标位置信号
);

// ******************************************************************** //
// ********************* Clock Generation **************************** //
// ******************************************************************** //

initial begin
    sys_clk = 0;
end

always #21 sys_clk = ~sys_clk;  // 24MHz时钟的近似信号，半周期为21ns

// ******************************************************************** //
// ************************ Testbench Code **************************** //
// ******************************************************************** //

initial begin
    // 初始化所有输入信号
    sys_rst_n = 0;                 // 复位信号初始化为低
    target_angles = 9'd0;          // 初始目标角度为0

    #100;                          // 等待100ns

    sys_rst_n = 1;                 // 释放复位信号

    // 模拟给出第一个目标角度
    #200;                          // 等待200ns
    target_angles = -32'd7680;     
    
    // 模拟给出第二个目标角度
    #500000000;   
    #500000000;
    #500000000;
    
end

endmodule
