`timescale 1ns/1ps

module tb_solver_bigarm;

// ******************************************************************** //
// ********************* Signal Declarations ************************** //
// ******************************************************************** //

reg                 sys_clk;
reg                 sys_rst_n;
reg  signed [31:0]  i_x;              // 测试输入的 X 坐标
reg  signed [31:0]  i_y;              // 测试输入的 Y 坐标

wire                step_pulse;       // 输出的步进电机脉冲信号
wire                direction;        // 输出的步进电机方向信号
wire                reached_target;   // 步进电机是否达到目标位置

//glbl Instantiate
glbl glbl();

// ******************************************************************** //
// ******************** Instantiation of the DUT ********************** //
// ******************************************************************** //

solver_bigarm uut (
    .sys_clk(sys_clk),
    .sys_rst_n(sys_rst_n),
    .i_x(i_x),
    .i_y(i_y),
    .step_pulse(step_pulse),
    .direction(direction),
    .reached_target(reached_target)
);

// ******************************************************************** //
// ********************* Clock Generation **************************** //
// ******************************************************************** //

initial begin
    sys_clk = 0;
end

always #21 sys_clk = ~sys_clk;  // 24MHz时钟的近似信号，半周期为21ns

// ******************************************************************** //
// ************************ Testbench Code **************************** //
// ******************************************************************** //

initial begin
    // 初始化信号
    sys_clk = 0;
    sys_rst_n = 0;
    i_x = 0;
    i_y = 0;
    
    // 复位
    #20;
    sys_rst_n = 1;
    
    // 设置第一个测试坐标
    #10;
    i_x = 32'd345;
    i_y = 32'd135;
    
    //#500000000;                    // 等待足够长的时间来模拟电机转动
    #5000;


    // 停止仿真
    $stop;
end

endmodule
